azure/repind-ri-ws/api/CreateOrUpdateIndividualWS/v6/Regression Tests/CreateUpdate Travel Companion/CreateOrUpdate.bru

meta {
  name: CreateOrUpdate
  type: http
  seq: 1
}

post {
  url: {{create-or-update-individual-v6-url}}
  body: xml
  auth: none
}

headers {
  SOAPAction: "http://www.af-klm.com/services/passenger/CreateUpdateIndividualService-v6/createIndividual"
}

body:xml {
  <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
     <soapenv:Body>
        <ns7:CreateUpdateIndividualRequestElement xmlns:ns6="http://www.af-klm.com/services/passenger/SoftComputingType-v1/xsd" 
            xmlns:ns5="http://www.af-klm.com/services/passenger/SicMarketingType-v1/xsd" 
            xmlns:ns8="http://www.af-klm.com/services/passenger/request-v6/xsd" 
            xmlns:ns7="http://www.af-klm.com/services/passenger/data-v6/xsd" 
            xmlns:ns2="http://www.af-klm.com/services/passenger/SicCommonType-v1/xsd" 
            xmlns:ns4="http://www.af-klm.com/services/passenger/response-v6/xsd" 
            xmlns:ns3="http://www.af-klm.com/services/passenger/SicIndividuType-v2/xsd">
           <requestor>        
              <channel>B2C</channel>        
              <context>B2C_BOOKING_PROCESS</context>        
              <token>WSSiC2</token>        
              <applicationCode>ISI</applicationCode>        
              <site>VLB</site>        
              <signature>REPIND-3232</signature>    
           </requestor>        
           <individualRequest>        
              <individualInformations>            
                 <identifier>400508465441</identifier>        
              </individualInformations>    
           </individualRequest>   
           <marketingDataRequest>        
              <marketingInformation>            
                 <travelCompanion>                
                    <civility>MR</civility>                
                    <firstName>VALOU</firstName>                
                    <lastName>POIROT</lastName>                
                    <dateOfBirth>1964-01-01T00:00:00Z</dateOfBirth>                
                    <email>POI@REP.COM</email>            
                 </travelCompanion>            
                 <personalInformation/>        
              </marketingInformation>    
           </marketingDataRequest>     
        </ns7:CreateUpdateIndividualRequestElement>
     </soapenv:Body>
  </soapenv:Envelope>
}

vars:pre-request {
  USER: W90000442
  PASSWORD: pswpsw123
}

assert {
  res.status: eq 200
}
